blog/app/controllers/articles_controller.rb

INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('Cielo Ramírez', 'Holaa', '2020-08-27 00:58:55.487448', '2020-08-27 00:58:55.487448')
---
    def create
        @article = Article.new(article_params)

        if @article.save

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `articles`.`title` = 'Holiwi', `articles`.`updated_at` = '2020-08-27 01:27:21.701309' WHERE `articles`.`id` = 1
---
    def update
        @article = Article.find(params[:id])

        if @article.update(article_params)