blog/app/controllers/comments_controller.rb

    def create
        @article = Article.find(params[:article_id])
        @comment = @article.comments.create(comment_params)
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
INSERT INTO `comments` (`commenter`, `body`, `article_id`, `created_at`, `updated_at`) VALUES ('ADrian Robles', 'HOlaaa', 2, '2020-08-27 02:01:38.595592', '2020-08-27 02:01:38.595592')